'''
#Input: รับจำนวนเต็มบวกสองจำนวนเก็บใส่ d กับ n
#Process: สร้างสตริงใหม่จากจำนวน d ที่มี n หลัก โดยถ้า d มีไม่ครบ n หลัก ก็ต้องเติมเลข 0 ไว้ทางซ้ายให้ครบ n หลัก แต่ถ้า d มีจำนวนหลัก ≥ n หลัก ก็ให้เป็นสตริงของ d เดิม
#Output: สตริงใหม่ที่ต้องการ
'''
d=input("ใส่จำนวนเต็มบวกตัวที่หนึ่ง : ")
n=input("ใส่จำนวนเต็มบวกตัวที่สอง : ")
if len(d) < int(n):
  D = d+"0"*(int(n)-len(d))
else:
  D = d
print(D)
#หรืออีกหนึ่งCode
d = input()
n = int(input())
D = "0"*n + str(d)
D = D[-max(n,len(str(d))):]
print(D)
